# "=============переменные==========="
# # переменные - это ссылка на ячейку памяти, где хранятся какие-то данные, для дальнейшего использование этих данных, при помощи обращения к названию переменной

# number1 = 123
# number2 = 35

# print(number1 + number2)
# print(123456)

# '============Правила наименования переменных========'
# a = 5 # можно, но назначение не понятно
# #1number=123-нельзя начинать название с чисел
# #my-name='Katana'-#нельзя использовать в названии символы,кроме_(my_name)
# # hello world - нельзя использовать символы, кроме _
# print = 12 - нельзя называть переменные ключевыми словами и названиями функций

# Snake Case - python стиль наименования переменной
# my_name = 'katana'

# Camel Case - стиль остальных языков программирования
# myName = 'katana'

#'==========Ввод и вывод данных========'

##print-функция вывода данных в терминал
##input-функция ввода данных с терминала

# number = input("Введите число")
# print(number)

# Запросите у пользователя имя и фамилию и распечатайте их в терминале

# name = input("введите ваше имя:")
# surname = input('Введите вашу фамилию:')

#name='Sultan'

#namber1=10
#namber2=12
#print(number1+number2)#22

#number3='10'
#number4='12'
#print(number3+number4)#1012

#number15=int('15')

num1=int(input('Введите первое число:'))#'100'
num2=int(input('Введите второе число:'))#'5'
print(num1+num2)

#'==============Типы данных========='
# типы данных делятся на 2 вида: изменяемые и неизменяемые

#Изменяемые:List(список),dict(словарь),set(множества)

#Неизменяемые:int(чмсла),float(вещественные),decimal(вещественные),str(строка),tuple(кортежи),bool(булевые),frozenset(не изменяемые сеты)complex,None(пустота)

